---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideWalklineOffsetFailure
source: html/09f4d042-c4f7-5d77-777c-834691c2c318.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideWalklineOffsetFailure Property

Please enter a value between 0 and half of Actual Run Width (%1/2 Actual Run Width%).

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunInsideWalklineOffsetFailure { get; }
```